In [1]:
import pandas as pd

In [29]:
my_series = pd.Series([1, 6, -9.1, 123, -56, 56])

In [30]:
my_series

0      1.0
1      6.0
2     -9.1
3    123.0
4    -56.0
5     56.0
dtype: float64

In [6]:
my_series[3:]

3    123.0
4    -56.0
5     56.0
dtype: float64

In [7]:
my_series[my_series > 0]

0      1.0
1      6.0
3    123.0
5     56.0
dtype: float64

In [8]:
my_series * 2

0      2.0
1     12.0
2    -18.2
3    246.0
4   -112.0
5    112.0
dtype: float64

In [9]:
import numpy as np

In [10]:
np.exp(my_series)

0    2.718282e+00
1    4.034288e+02
2    1.116658e-04
3    2.619517e+53
4    4.780893e-25
5    2.091659e+24
dtype: float64

In [11]:
%time
np.sum(my_series)

CPU times: user 7 µs, sys: 1e+03 ns, total: 8 µs
Wall time: 13.8 µs

120.9

In [13]:
%time
sum(my_series)

CPU times: user 3 µs, sys: 0 ns, total: 3 µs
Wall time: 7.39 µs

120.9

In [52]:
df = pd.DataFrame({
    'name': ['Маша', 'Вася', 'Эдуард'],
    'age': [25, 8, 48],
    'job': ['Программист', 'Школьник', 'Big Boss'],
    'salary': [100, 10, 200]
}, index=['some', 'random', 'words'])

In [53]:
df

          name  age          job  salary
some      Маша   25  Программист     100
random    Вася    8     Школьник      10
words   Эдуард   48     Big Boss     200

In [54]:
df['name']

some        Маша
random      Вася
words     Эдуард
Name: name, dtype: object

In [55]:
df[df['salary'] >= 100]

         name  age          job  salary
some     Маша   25  Программист     100
words  Эдуард   48     Big Boss     200

In [56]:
df['salary'] *= 10

In [57]:
df

          name  age          job  salary
some      Маша   25  Программист    1000
random    Вася    8     Школьник     100
words   Эдуард   48     Big Boss    2000

In [58]:
df['salary'] / 2

some       500.0
random      50.0
words     1000.0
Name: salary, dtype: float64

In [59]:
df

          name  age          job  salary
some      Маша   25  Программист    1000
random    Вася    8     Школьник     100
words   Эдуард   48     Big Boss    2000

In [60]:
df.loc['some':'random']

        name  age          job  salary
some    Маша   25  Программист    1000
random  Вася    8     Школьник     100

In [61]:
df.iloc[1]

name          Вася
age              8
job       Школьник
salary         100
Name: random, dtype: object

In [62]:
df.iloc[:1]

      name  age          job  salary
some  Маша   25  Программист    1000